Revit 2024 API
ColumnAttachment Methods
The ColumnAttachment type exposes the following members.
Methods
Name | Description
AddColumnAttachment
 Attaches the column to the target. If an attachment already exists with the same "baseOrTop" value, no attachment is made.
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetColumnAttachment(FamilyInstance, ElementId)
 Look up a column attachment by specifying the target id.
GetColumnAttachment(FamilyInstance, Int32)
 Look up a column attachment. There is at most one attachment on the base and one on the top.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
IsValidColumn
 Says whether a FamilyInstance supports column attachments.
IsValidTarget(Boolean, Element)
 Says whether the element can be used as a target for a new attachment.
IsValidTarget(FamilyInstance, Element)
 Says whether the element can be used as a target for a new attachment.
RemoveColumnAttachment(FamilyInstance, ElementId)
 Removes any attachment of the column to the specified target.
RemoveColumnAttachment(FamilyInstance, Int32)
 Removes an attachment at the top or base of a column, if there is one.
SetJustification
 Setter of ColumnAttachmentJustification
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
ColumnAttachment Class
Autodesk.Revit.DB Namespace